Revit 2027 API
DWGExportOptions Class
 The export options used by exporting DWG format file.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseExportOptions
 Autodesk.Revit.DB.ACADExportOptions
 Autodesk.Revit.DB.DWGExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DWGExportOptions : ACADExportOptions
Public Class DWGExportOptions
	Inherits ACADExportOptions
public ref class DWGExportOptions : public ACADExportOptions
type DWGExportOptions =
    class
        inherit ACADExportOptions
    end
The DWGExportOptions type exposes the following members.
Constructors
Name | Description
DWGExportOptions() |  Constructs a new instance of DWGExportOptions with default values of all properties.
DWGExportOptions(DWGExportOptions) |  Constructs a new instance of DWGExportOptions as a copy of the export options.
Top
Properties
Name | Description
ACAPreference |  The preferred way to generate geometry of ACA objects. Default value is ACAObjectPreference.Object.
(Inherited from ACADExportOptions)
Colors |  Export color mode. Default value is ExportColorMode.IndexColors.
(Inherited from BaseExportOptions)
ExportingAreas |  True to export area and room geometry, false otherwise. Default value is false.
(Inherited from ACADExportOptions)
ExportOfSolids |  The mode used to export solids in 3D views. Default value is SolidGeometry.Polymesh.
(Inherited from ACADExportOptions)
FileVersion |  ACADVersion::Default Default value is ACADVersion.Default.
(Inherited from ACADExportOptions)
HatchBackgroundColor |  The color that will be set as hatch backgound color on the exported hatch. This color will be used only if useHatchBackgroundColor is true. default value is white
(Inherited from ACADExportOptions)
HatchPatternsFileName |  Custom hatch patterns (pat) file name.
(Inherited from BaseExportOptions)
HideReferencePlane |  Whether or not to hide reference planes. Default value is false.
(Inherited from BaseExportOptions)
HideScopeBox |  Whether or not to hide the scope box. Default value is false.
(Inherited from BaseExportOptions)
HideUnreferenceViewTags |  Whether or not to hide unreference view tags. Default value is false.
(Inherited from BaseExportOptions)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from BaseExportOptions)
LayerMapping |  Name of a layer settings standard or filename (with custom layer settings). Valid standards are: DGNV7 (only for DGN), AIA, CP83, BS1192, and ISO13567. default value is "" (empty) which means if no value is set, if no value is set, Revit will use a default value according to the localization.
(Inherited from BaseExportOptions)
LineScaling |  The scaling mode for the line type. Default value is LineScaling.ViewScale.
(Inherited from ACADExportOptions)
LinetypesFileName |  The custom linetype file name (*.lin). Default value is empty.
(Inherited from ACADExportOptions)
MarkNonplotLayers |  If true and the nonplot layer suffix is not empty, all layers whose names contain that suffix will be marked as non-plot.
(Inherited from ACADExportOptions)
MergedViews |  Whether to merge all views in one file (via XRefs). Default value is false for mergedViews.
NonplotSuffix |  If the MarkNonplotLayers attribute is set to true, all layers with names containing this suffix will be marked as non-plot. No action will be performed if the suffix is empty.
(Inherited from ACADExportOptions)
PreserveCoincidentLines |  Whether or not to preserve coincident lines. Default value is false.
(Inherited from BaseExportOptions)
PropOverrides |  How to export overridden object styles. Default value is PropOverrideMode.ByEntity.
(Inherited from BaseExportOptions)
SharedCoords |  True to use the shared coordinate system's origin, false to use the project origin. Default value is false.
(Inherited from ACADExportOptions)
TargetUnit |  The target unit type. Default value is ExportUnit.Default.
(Inherited from ACADExportOptions)
TextTreatment |  The text treatment. Deault value is TextTreatment.Exact.
(Inherited from ACADExportOptions)
UseHatchBackgroundColor |  Indicates if hatch background color will be used or not. default value is false.
(Inherited from ACADExportOptions)
Top
Methods
Name | Description
Dispose
(Inherited from BaseExportOptions)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetExportFontTable |  Gets font table.
(Inherited from BaseExportOptions)
GetExportLayerTable |  Gets the layer table.
(Inherited from BaseExportOptions)
GetExportLinetypeTable |  Gets a copy of the line type table.
(Inherited from BaseExportOptions)
GetExportPatternTable |  Gets a copy of the pattern table.
(Inherited from BaseExportOptions)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetPredefinedOptions |  Returns an instance DWGExportOptions containing settings from a predefined export setup.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetExportFontTable |  Sets font table to option.
(Inherited from BaseExportOptions)
SetExportLayerTable |  Sets layer table back to option
(Inherited from BaseExportOptions)
SetExportLinetypeTable |  Sets the line type table to use during export.
(Inherited from BaseExportOptions)
SetExportPatternTable |  Sets the pattern table to use during export.
(Inherited from BaseExportOptions)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace